#include <stdint.h>

/******************************************************************************/
/*
 * Перевод BCD формата в десятичный
 */
/******************************************************************************/
uint32_t bcd_to_dec ( uint32_t bcd )
{
	uint32_t dec = 0;
		
	for ( uint32_t mult = 1 ; bcd ; bcd = bcd >> 4 )
	{	
		dec += ( bcd & 0x0f ) * mult;
		
		mult *= 10;
	}
		
	return dec;
}

/******************************************************************************/
/*
 * Перевод десятичного формата в BCD формат
 */
/******************************************************************************/
uint32_t dec_to_bcd ( uint32_t dec )
{
	uint32_t bcd = 0;
		
	uint32_t i = 0;
		
	while ( dec > 0 ) 
	{		
		bcd =  bcd | ( ( dec - ( dec / 10 ) * 10 ) << ( i * 4 ) );
		
		i++;
		
		dec /= 10;
	}
		
	return bcd;
}















